In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import sklearn

In [2]:
df = pd.read_csv('User_Data.csv')

In [3]:
df.columns

Index(['User ID', 'Gender', 'Age', 'EstimatedSalary', 'Purchased'], dtype='object')

In [4]:
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [5]:
df.tail()

      User ID  Gender  Age  EstimatedSalary  Purchased
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

In [6]:
df.shape

(400, 5)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [8]:
df.describe()

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [9]:
df.isnull().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [10]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
395    False
396    False
397    False
398    False
399    False
Length: 400, dtype: bool

In [11]:
df[df.duplicated()]

Empty DataFrame
Columns: [User ID, Gender, Age, EstimatedSalary, Purchased]
Index: []

In [12]:
df

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [13]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [14]:
df['Gender'] = df['Gender'].map({'Male' : 1 ,'Female' : 2})

In [15]:
df.rename(columns={'User ID' : 'User_ID' },inplace=True)

In [16]:
df.drop(['User_ID'],axis=1,inplace=True)

In [17]:
df

     Gender  Age  EstimatedSalary  Purchased
0         1   19            19000          0
1         1   35            20000          0
2         2   26            43000          0
3         2   27            57000          0
4         1   19            76000          0
..      ...  ...              ...        ...
395       2   46            41000          1
396       1   51            23000          1
397       2   50            20000          1
398       1   36            33000          0
399       2   49            36000          1

[400 rows x 4 columns]

In [18]:
#Data Normalization
#from sklearn.preprocessing import StandardScaler
#scaler = StandardScaler()
#scaler.fit(df)
#scaled_data = scaler.transform(df)
#scaled_data
#df1=pd.DataFrame(scaled_data,columns=df.columns)
#df1

In [19]:
x = df.iloc[:,:3]
y = df.iloc[:,3]

In [20]:
x.shape

(400, 3)

In [21]:
y.shape

(400,)

In [22]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size= 0.2,random_state=12)

In [23]:
print(x_train.shape)
print(x_test.shape)
print(y_train.shape)
print(y_test.shape)

(320, 3)
(80, 3)
(320,)
(80,)

In [34]:
classifier = LogisticRegression()
classifier.fit(x_train,y_train)

LogisticRegression()

In [35]:
y_pred = classifier.predict(x_test)
y_pred

array([1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0,
       0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0,
       0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0,
       1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0], dtype=int64)

In [36]:
y_test

280    1
387    0
313    1
1      0
35     0
      ..
149    0
301    1
78     0
71     0
186    0
Name: Purchased, Length: 80, dtype: int64

In [37]:
y_test.shape

(80,)

In [38]:
y_pred.shape

(80,)

In [41]:
#check the accuracy of model by using test data
from sklearn.metrics import accuracy_score,confusion_matrix
print('Accuarcy : ',accuracy_score(y_test,y_predict))

con_matrix = confusion_matrix(y_test,y_pred)
print('Correct and Incorrect Prediction : ','\n',con_matrix,end=' ')

Accuarcy :  0.6875
Correct and Incorrect Prediction :
 [[39  9]
 [16 16]]

In [ ]:
#39+16 = 55 correct prediction and 16+9 = 25 incorrect prediction total 80 recodrs present